[{"Section_title":"Visiting Our Church","Content":"Visiting a church for the first time can be a scary experience. At Bible Baptist, we realize that and want to make you feel as much at ease as possible. At Bible Baptist, we focus on the timeless basics: worshipping God, studying God's Word, serving each other and seeking to make disciples of Jesus Christ. We think we've found something special at BBC. It's more than a church, it's a place where we feel \"at home\" and we want to welcome you to experience it to.","Image":[{"id":"attyeRKvPkBDbp4CG","url":"https://dl.airtable.com/QX979hRIQ9OBdLPELe0m_2cDdF43IQqyCyDjPxDKw_IMG_0354.JPG","filename":"2cDdF43IQqyCyDjPxDKw_IMG_0354.JPG","size":46690,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/xhRattRo6OSOpTzunD0g_small_2cDdF43IQqyCyDjPxDKw_IMG_0354.JPG","width":36,"height":36},"large":{"url":"https://dl.airtable.com/qqsVy85OTxiu0jxBGvT1_large_2cDdF43IQqyCyDjPxDKw_IMG_0354.JPG","width":350,"height":350}}}]},{"Section_title":"Our Services","Content":"Bible Baptist has services on Sunday morning at 10:30 AM, Sunday evening at 6:00 PM, and Wednesday evening at 7:00 PM. While guests are welcome at all of these services, if you want to get a feel for all that Bible Baptist has to offer, you should plan to attend one of our Sunday Morning services at 10:30 AM.\n\nServices at Bible Baptist are traditional, but not in a stiff or formal way. There is no dress code for our services, and many people dress in both traditional church attire and more casual clothes. We try to keep the services as simple as possible, singing hymns (both old and new), receiving an offering, and hearing a Bible message. Our services almost always last slightly less than one hour.\n"},{"Section_title":"Kids","Content":"BBC has a lot going on for kids including Sunday School, Children’s Church for two age groups, and Patch the Pirate Clubs  on Thursday nights.  One different thing about our church is that our kids participate in the worship part of the Sunday Morning service and are dismissed to children’s church before the sermon.  **Nursery is provided for every service.**","Image":[{"id":"attkRomIu76RnviGA","url":"https://dl.airtable.com/1ADfL0HQQ9eDtKu5tCSK_3nhSzjJjTvmwMAsMUe5G_IMG_0013.JPG","filename":"3nhSzjJjTvmwMAsMUe5G_IMG_0013.JPG","size":42123,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/PEWyHczeSmKB73y6zBdE_small_3nhSzjJjTvmwMAsMUe5G_IMG_0013.JPG","width":36,"height":36},"large":{"url":"https://dl.airtable.com/8kHO2vhT1aaqzQiBnppz_large_3nhSzjJjTvmwMAsMUe5G_IMG_0013.JPG","width":300,"height":300}}}]},{"Section_title":"Location","Content":"Bible Baptist is located at the corner S 34th St. and Marion Ave in the southwest corner of Mattoon. Our church building facilities include ample parking, newly renovated nurseries and classroom space, a fellowship hall and gymnasium."}]
